AcLocale.#ctor(System.Int32)
allow implicit conversion from Windows Locale LCID
lcid: Windows locale ID

AcLocale.isValid
Check if the locale object is valid. If there is no language name
or it can't supported by system, it is invalid.
Returns:
Return true if it is a valide locale object, otherwise false

AcLocale.iso2CountryName
Get the ISO-3166 country name
Returns:
Return a buffer contains iso country name

AcLocale.iso2LangName
Get the ISO-639-1 language name
Returns:
Return a buffer contains iso language name

AcLocale.op_Inequality(AcLocale!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Check if two locale objects are not equal

AcLocale.op_Equality(AcLocale!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Check if two locale objects are equal

AcLocale.op_Assign(AcLocale*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Move assignment

AcLocale.#ctor(AcLocale*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Move constructor

AcLocale.op_Assign(AcLocale!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Operator assignment

AcLocale.#ctor(AcLocale!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Copy constructor

AcLocale.Dispose
Destructor

AcLocale.#ctor(System.Char!System.Runtime.CompilerServices.IsConst*,System.Char!System.Runtime.CompilerServices.IsConst*)
Create a locale class with language name and country name. If the input country name and
language name is nullptr or empty, it will get the current system locale.
isoLangName: lower-case two-letter codes as defined by ISO-639-1.
isoCountryName: the upper-case two-letter codes as defined by ISO-3166. It can be nullptr.